ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/components/driverlib/inc/pg1/hw_factory_cfg.h
/******************************************************************************
*            TEXAS INSTRUMENTS INCORPORATED PROPRIETARY INFORMATION
*
*   Property of Texas Instruments
*   For  Unrestricted  Internal  Use  Only
*   Unauthorized reproduction and/or distribution is strictly prohibited.
*   This product is protected under copyright law and trade secret law
*   as an unpublished work.
*   Created 2011, (C) Copyright 2011 Texas Instruments.  All rights reserved.
*
*          ***** PROVISIONAL CODE - FOR DEMONSTRATION USE ONLY *****
*
*                       ---------------------------------
* ----------------------- NB This file is autogenerated -----------------------
*                       ---------------------------------
*
******************************************************************************/

#ifndef __FACTORY_CFG_H__
#define __FACTORY_CFG_H__

//*****************************************************************************
//
// The following are defines for the FACTORY_CFG register offsets.
//
//*****************************************************************************
#define FACTORY_CFG_O_SHDW_EFUSE_CONTROL \
                                0x0000010C  

#define FACTORY_CFG_O_SHDW_REDUNDANT0 \
                                0x00000110  

#define FACTORY_CFG_O_SHDW_REDUNDANT1 \
                                0x00000114  

#define FACTORY_CFG_O_SHDW_DIE_ID_0 \
                                0x00000118  

#define FACTORY_CFG_O_SHDW_DIE_ID_1 \
                                0x0000011C  

#define FACTORY_CFG_O_SHDW_DIE_ID_2 \
                                0x00000120  

#define FACTORY_CFG_O_SHDW_DIE_ID_3 \
                                0x00000124  

#define FACTORY_CFG_O_SHDW_SCAN_DATA0 \
                                0x00000128  

#define FACTORY_CFG_O_SHDW_SCAN_DATA1 \
                                0x0000012C  

#define FACTORY_CFG_O_SHDW_SCAN_DATA2_BOOT \
                                0x00000130  

#define FACTORY_CFG_O_SHDW_BANK_TRIM_BOOT \
                                0x00000134  

#define FACTORY_CFG_O_SHDW_OSC_BIAS_LDO_TRIM \
                                0x00000138  

#define FACTORY_CFG_O_SHDW_ANA_TRIM \
                                0x0000013C  

#define FACTORY_CFG_O_FLASH_E_P 0x00000170  
#define FACTORY_CFG_O_FLASH_C_E_P_R \
                                0x00000174  

#define FACTORY_CFG_O_FLASH_P_R_PV \
                                0x00000178  

#define FACTORY_CFG_O_FLASH_EH_SEQ \
                                0x0000017C  

#define FACTORY_CFG_O_FLASH_VHV_E \
                                0x00000180  

#define FACTORY_CFG_O_FLASH_PP  0x00000184  
#define FACTORY_CFG_O_FLASH_PROG_EP \
                                0x00000188  

#define FACTORY_CFG_O_FLASH_ERA_PW \
                                0x0000018C  

#define FACTORY_CFG_O_FLASH_VHV 0x00000190  
#define FACTORY_CFG_O_FLASH_VHV_PV \
                                0x00000194  

#define FACTORY_CFG_O_FLASH_V   0x00000198  
#define FACTORY_CFG_O_USER_ID   0x00000294  
#define FACTORY_CFG_O_FLASH_OTP_DATA1 \
                                0x000002A8  

#define FACTORY_CFG_O_FLASH_OTP_DATA2 \
                                0x000002AC  

#define FACTORY_CFG_O_FLASH_OTP_DATA3 \
                                0x000002B0  

#define FACTORY_CFG_O_MAC_BLE_0 0x000002E8  
#define FACTORY_CFG_O_MAC_BLE_1 0x000002EC  
#define FACTORY_CFG_O_MAC_15_4_0 \
                                0x000002F0  

#define FACTORY_CFG_O_MAC_15_4_1 \
                                0x000002F4  

#define FACTORY_CFG_O_ICEPICK_DEVICE_ID \
                                0x00000318  

#define FACTORY_CFG_O_FCFG1_REVISION \
                                0x0000031C  

#define FACTORY_CFG_O_MISC_OTP_DATA \
                                0x00000320  

#define FACTORY_CFG_O_CONFIG_IF_ADC \
                                0x0000034C  

#define FACTORY_CFG_O_CONFIG_OSC_TOP \
                                0x00000350  

#define FACTORY_CFG_O_CONFIG_RF_FRONTEND \
                                0x00000354  

#define FACTORY_CFG_O_CONFIG_SYNTH \
                                0x00000358  

#define FACTORY_CFG_O_SOC_ADC_ABS_GAIN \
                                0x0000035C  

#define FACTORY_CFG_O_SOC_ADC_REL_GAIN \
                                0x00000360  

#define FACTORY_CFG_O_SOC_ADC_EXT_GAIN \
                                0x00000364  

#define FACTORY_CFG_O_SOC_ADC_OFFSET_INT \
                                0x00000368  

#define FACTORY_CFG_O_SOC_ADC_REF_TRIM_AND_OFFSET_EXT \
                                0x0000036C  

#define FACTORY_CFG_O_AMPCOMP_TH1 \
                                0x00000370  

#define FACTORY_CFG_O_AMPCOMP_TH2 \
                                0x00000374  

#define FACTORY_CFG_O_AMPCOMP_CTRL1 \
                                0x00000378  

#define FACTORY_CFG_O_ANABYPASS_VALUE2 \
                                0x0000037C  

#define FACTORY_CFG_O_CONFIG_MISC_ADC \
                                0x00000380  

#define FACTORY_CFG_O_TEST_TEMPS \
                                0x00000384  

#define FACTORY_CFG_O_VOLT_TRIM 0x00000388  
#define FACTORY_CFG_O_OSC_CONF  0x0000038C  
#define FACTORY_CFG_O_FREQ_OFFSET \
                                0x00000390  

#define FACTORY_CFG_O_CAP_TRIM  0x00000394  

//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_SHDW_EFUSE_CONTROL register.
//
//*****************************************************************************
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_SHDW_REDUNDANT0 register.
//
//*****************************************************************************
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_SHDW_REDUNDANT1 register.
//
//*****************************************************************************
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_SHDW_DIE_ID_0 register.
//
//*****************************************************************************
#define FACTORY_CFG_SHDW_DIE_ID_0_ID_31_0_M \
                                0xFFFFFFFF  // Shadow of corresponding bits in 
                                            // efuse row number 3 [PROD: X] 

#define FACTORY_CFG_SHDW_DIE_ID_0_ID_31_0_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_SHDW_DIE_ID_1 register.
//
//*****************************************************************************
#define FACTORY_CFG_SHDW_DIE_ID_1_ID_63_32_M \
                                0xFFFFFFFF  // Shadow of corresponding bits in 
                                            // efuse row number 4 [PROD: X] 

#define FACTORY_CFG_SHDW_DIE_ID_1_ID_63_32_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_SHDW_DIE_ID_2 register.
//
//*****************************************************************************
#define FACTORY_CFG_SHDW_DIE_ID_2_ID_95_64_M \
                                0xFFFFFFFF  // Shadow of corresponding bits in 
                                            // efuse row number 5 [PROD: X] 

#define FACTORY_CFG_SHDW_DIE_ID_2_ID_95_64_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_SHDW_DIE_ID_3 register.
//
//*****************************************************************************
#define FACTORY_CFG_SHDW_DIE_ID_3_ID_127_96_M \
                                0xFFFFFFFF  // Shadow of corresponding bits in 
                                            // efuse row number 6 [PROD: X] 

#define FACTORY_CFG_SHDW_DIE_ID_3_ID_127_96_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_SHDW_SCAN_DATA0 register.
//
//*****************************************************************************
#define FACTORY_CFG_SHDW_SCAN_DATA0_ULL_MCU_RAM1_REP_M \
                                0xE0000000  // Shadow of corresponding bits in 
                                            // efuse row number 7 [PROD: X] 

