ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/components/driverlib/inc/pg1/hw_factory_cfg.h
#define FACTORY_CFG_SHDW_SCAN_DATA0_ULL_MCU_RAM1_REP_S 29
#define FACTORY_CFG_SHDW_SCAN_DATA0_ULL_MCU_RAM2_REP_M \
                                0x1FF80000  // Shadow of corresponding bits in 
                                            // efuse row number 7 [PROD: X] 

#define FACTORY_CFG_SHDW_SCAN_DATA0_ULL_MCU_RAM2_REP_S 19
#define FACTORY_CFG_SHDW_SCAN_DATA0_ULL_MCU_RAM3_REP_M \
                                0x0007FE00  // Shadow of corresponding bits in 
                                            // efuse row number 7 [PROD: X] 

#define FACTORY_CFG_SHDW_SCAN_DATA0_ULL_MCU_RAM3_REP_S 9
#define FACTORY_CFG_SHDW_SCAN_DATA0_ULL_AUX_RAM_REP_M \
                                0x000001FE  // Shadow of corresponding bits in 
                                            // efuse row number 7 [PROD: X] 

#define FACTORY_CFG_SHDW_SCAN_DATA0_ULL_AUX_RAM_REP_S 1
#define FACTORY_CFG_SHDW_SCAN_DATA0_TAP_DAP_LOCK \
                                0x00000001  // Shadow of corresponding bits in 
                                            // efuse row number 7 [PROD: X] 

#define FACTORY_CFG_SHDW_SCAN_DATA0_TAP_DAP_LOCK_M \
                                0x00000001
#define FACTORY_CFG_SHDW_SCAN_DATA0_TAP_DAP_LOCK_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_SHDW_SCAN_DATA1 register.
//
//*****************************************************************************
#define FACTORY_CFG_SHDW_SCAN_DATA1_ULL_MCU_RAM0_REP_M \
                                0x0001FF80  // Shadow of corresponding bits in 
                                            // efuse row number 8 [PROD: X] 

#define FACTORY_CFG_SHDW_SCAN_DATA1_ULL_MCU_RAM0_REP_S 7
#define FACTORY_CFG_SHDW_SCAN_DATA1_ULL_MCU_RAM1_REP_M \
                                0x0000007F  // Shadow of corresponding bits in 
                                            // efuse row number 8 [PROD: X] 

#define FACTORY_CFG_SHDW_SCAN_DATA1_ULL_MCU_RAM1_REP_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_SHDW_SCAN_DATA2_BOOT register.
//
//*****************************************************************************
#define FACTORY_CFG_SHDW_SCAN_DATA2_BOOT_FLASH_RDY \
                                0x80000000  // Shadow of corresponding bits in 
                                            // efuse row number 9 [PROD: X] 

#define FACTORY_CFG_SHDW_SCAN_DATA2_BOOT_FLASH_RDY_M \
                                0x80000000
#define FACTORY_CFG_SHDW_SCAN_DATA2_BOOT_FLASH_RDY_S 31
#define FACTORY_CFG_SHDW_SCAN_DATA2_BOOT_CRC_M \
                                0x000001FE  // Shadow of corresponding bits in 
                                            // efuse row number 9 [PROD: X] 

#define FACTORY_CFG_SHDW_SCAN_DATA2_BOOT_CRC_S 1
#define FACTORY_CFG_SHDW_SCAN_DATA2_BOOT_TAP_DAP_LOCK_N \
                                0x00000001  // Shadow of corresponding bits in 
                                            // efuse row number 9 [PROD: X] 

#define FACTORY_CFG_SHDW_SCAN_DATA2_BOOT_TAP_DAP_LOCK_N_M \
                                0x00000001
#define FACTORY_CFG_SHDW_SCAN_DATA2_BOOT_TAP_DAP_LOCK_N_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_SHDW_BANK_TRIM_BOOT register.
//
//*****************************************************************************
#define FACTORY_CFG_SHDW_BANK_TRIM_BOOT_ROM_BOOT \
                                0x20000000  // Shadow of corresponding bits in 
                                            // efuse row number 10 [PROD: X] 

#define FACTORY_CFG_SHDW_BANK_TRIM_BOOT_ROM_BOOT_M \
                                0x20000000
#define FACTORY_CFG_SHDW_BANK_TRIM_BOOT_ROM_BOOT_S 29
#define FACTORY_CFG_SHDW_BANK_TRIM_BOOT_TRIM3P4_M \
                                0x1E000000  // Shadow of corresponding bits in 
                                            // efuse row number 10 [PROD: X] 

#define FACTORY_CFG_SHDW_BANK_TRIM_BOOT_TRIM3P4_S 25
#define FACTORY_CFG_SHDW_BANK_TRIM_BOOT_VCG2P5CT_M \
                                0x01E00000  // Shadow of corresponding bits in 
                                            // efuse row number 10 [PROD: X] 

#define FACTORY_CFG_SHDW_BANK_TRIM_BOOT_VCG2P5CT_S 21
#define FACTORY_CFG_SHDW_BANK_TRIM_BOOT_VREADCT_M \
                                0x001E0000  // Shadow of corresponding bits in 
                                            // efuse row number 10 [PROD: X] 

#define FACTORY_CFG_SHDW_BANK_TRIM_BOOT_VREADCT_S 17
#define FACTORY_CFG_SHDW_BANK_TRIM_BOOT_TRIM_0P8_M \
                                0x0001E000  // Shadow of corresponding bits in 
                                            // efuse row number 10 [PROD: X] 

#define FACTORY_CFG_SHDW_BANK_TRIM_BOOT_TRIM_0P8_S 13
#define FACTORY_CFG_SHDW_BANK_TRIM_BOOT_TRIM_M \
                                0x00001FFF  // Shadow of corresponding bits in 
                                            // efuse row number 10 [PROD: X] 

#define FACTORY_CFG_SHDW_BANK_TRIM_BOOT_TRIM_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_SHDW_OSC_BIAS_LDO_TRIM register.
//
//*****************************************************************************
#define FACTORY_CFG_SHDW_OSC_BIAS_LDO_TRIM_TRIMMAG_M \
                                0x07800000  // Shadow of corresponding bits in 
                                            // efuse row number 11 [PROD: X] 

#define FACTORY_CFG_SHDW_OSC_BIAS_LDO_TRIM_TRIMMAG_S 23
#define FACTORY_CFG_SHDW_OSC_BIAS_LDO_TRIM_TRIMIREF_M \
                                0x007C0000  // Shadow of corresponding bits in 
                                            // efuse row number 11 [PROD: X] 

#define FACTORY_CFG_SHDW_OSC_BIAS_LDO_TRIM_TRIMIREF_S 18
#define FACTORY_CFG_SHDW_OSC_BIAS_LDO_TRIM_ITRIM_DIG_LDO_M \
                                0x00030000  // Shadow of corresponding bits in 
                                            // efuse row number 11 [PROD: X] 

