ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/components/driverlib/inc/pg1/hw_factory_cfg.h
#define FACTORY_CFG_SHDW_OSC_BIAS_LDO_TRIM_ITRIM_DIG_LDO_S 16
#define FACTORY_CFG_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_DIG_M \
                                0x0000F000  // Shadow of corresponding bits in 
                                            // efuse row number 11 [PROD: X] 

#define FACTORY_CFG_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_DIG_S 12
#define FACTORY_CFG_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_COARSE_M \
                                0x00000F00  // Shadow of corresponding bits in 
                                            // efuse row number 11 [PROD: X] 

#define FACTORY_CFG_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_COARSE_S 8
#define FACTORY_CFG_SHDW_OSC_BIAS_LDO_TRIM_RCOSCHF_CTRIM_M \
                                0x000000FF  // Shadow of corresponding bits in 
                                            // efuse row number 11 [PROD: X] 

#define FACTORY_CFG_SHDW_OSC_BIAS_LDO_TRIM_RCOSCHF_CTRIM_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_SHDW_ANA_TRIM register.
//
//*****************************************************************************
#define FACTORY_CFG_SHDW_ANA_TRIM_VDDR_OK_HYS \
                                0x00800000  // Shadow of corresponding bits in 
                                            // efuse row number 12 [PROD: X] 

#define FACTORY_CFG_SHDW_ANA_TRIM_VDDR_OK_HYS_M \
                                0x00800000
#define FACTORY_CFG_SHDW_ANA_TRIM_VDDR_OK_HYS_S 23
#define FACTORY_CFG_SHDW_ANA_TRIM_IPTAT_TRIM_M \
                                0x00600000  // Shadow of corresponding bits in 
                                            // efuse row number 12 [PROD: X] 

#define FACTORY_CFG_SHDW_ANA_TRIM_IPTAT_TRIM_S 21
#define FACTORY_CFG_SHDW_ANA_TRIM_VDDR_TRIM_M \
                                0x001F0000  // Shadow of corresponding bits in 
                                            // efuse row number 12 [PROD: X] 

#define FACTORY_CFG_SHDW_ANA_TRIM_VDDR_TRIM_S 16
#define FACTORY_CFG_SHDW_ANA_TRIM_TRIMBOD_INTMODE_M \
                                0x0000F800  // Shadow of corresponding bits in 
                                            // efuse row number 12 [PROD: X] 

#define FACTORY_CFG_SHDW_ANA_TRIM_TRIMBOD_INTMODE_S 11
#define FACTORY_CFG_SHDW_ANA_TRIM_TRIMBOD_EXTMODE_M \
                                0x000007C0  // Shadow of corresponding bits in 
                                            // efuse row number 12 [PROD: X] 

#define FACTORY_CFG_SHDW_ANA_TRIM_TRIMBOD_EXTMODE_S 6
#define FACTORY_CFG_SHDW_ANA_TRIM_TRIMTEMP_M \
                                0x0000003F  // Shadow of corresponding bits in 
                                            // efuse row number 12 [PROD: X] 

#define FACTORY_CFG_SHDW_ANA_TRIM_TRIMTEMP_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_FLASH_E_P register.
//
//*****************************************************************************
#define FACTORY_CFG_FLASH_E_P_PSU_M \
                                0xFF000000  // Program setup time in cycles. 
                                            // Value will be written to the 
                                            // PGM_OSU field bits[15:8] of the 
                                            // FSM_PE_OSU register in the flash 
                                            // module by the flash device 
                                            // driver when an erase/program 
                                            // operation is initiated. [PROD: 
                                            // DP] 

#define FACTORY_CFG_FLASH_E_P_PSU_S 24
#define FACTORY_CFG_FLASH_E_P_ESU_M \
                                0x00FF0000  // Erase setup time in cycles. 
                                            // Value will be written to the 
                                            // ERA_OSU field bits[7:0] of the 
                                            // FSM_PE_OSU register in the flash 
                                            // module by the flash device 
                                            // driver when an erase/program 
                                            // operation is initiated. [PROD: 
                                            // DP] 

#define FACTORY_CFG_FLASH_E_P_ESU_S 16
#define FACTORY_CFG_FLASH_E_P_PVSU_M \
                                0x0000FF00  // Program verify setup time in 
                                            // cycles. Value will be written to 
                                            // the PGM_VSU field bits[15:8] of 
                                            // the FSM_PE_VSU register in the 
                                            // flash module by the flash device 
                                            // driver when an erase/program 
                                            // operation is initiated. [PROD: 
                                            // DP] 

#define FACTORY_CFG_FLASH_E_P_PVSU_S 8
#define FACTORY_CFG_FLASH_E_P_EVSU_M \
                                0x000000FF  // Erase verify setup time in 
                                            // cycles. Value will be written to 
                                            // the ERA_VSU field bits[7:0] of 
                                            // the FSM_PE_VSU register in the 
                                            // flash module by the flash device 
                                            // driver when an erase/program 
                                            // operation is initiated. [PROD: 
                                            // DP] 

#define FACTORY_CFG_FLASH_E_P_EVSU_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_FLASH_C_E_P_R register.
//
//*****************************************************************************
#define FACTORY_CFG_FLASH_C_E_P_R_RVSU_M \
                                0xFF000000  // Repeat verify setup time in 
                                            // cycles. Used for repeated 
                                            // verifies during program and 
                                            // erase. Value will be written to 
                                            // the REP_VSU field bits[15:8] of 
                                            // the FSM_EX_VAL register in the 
                                            // flash module by the flash device 
                                            // driver when an erase/program 
                                            // operation is initiated. [PROD: 
                                            // DP] 

#define FACTORY_CFG_FLASH_C_E_P_R_RVSU_S 24
#define FACTORY_CFG_FLASH_C_E_P_R_PV_ACCESS_M \
                                0x00FF0000  // Program verify EXECUTEZ->data 
                                            // valid time in half-microseconds. 
                                            // Value will be converted to 
                                            // number of FCLK cycles by by 
                                            // flash device driver and the 
                                            // converted value is written to 
                                            // the EXE_VALD field bits[7:0] of 
                                            // the FSM_EX_VAL register in the 
                                            // flash module when an 
                                            // erase/program operation is 
                                            // initiated.. [PROD: DP] 

#define FACTORY_CFG_FLASH_C_E_P_R_PV_ACCESS_S 16
#define FACTORY_CFG_FLASH_C_E_P_R_A_EXEZ_SETUP_M \
                                0x0000F000  // Address->EXECUTEZ setup time in 
                                            // cycles. Value will be written to 
                                            // the ADD_EXZ field bits[15:12] of 
                                            // the FSM_CMP_VSU register in the 
                                            // flash module by the flash device 
                                            // driver when an erase/program 
                                            // operation is initiated.. [PROD: 
                                            // DP] 

#define FACTORY_CFG_FLASH_C_E_P_R_A_EXEZ_SETUP_S 12
#define FACTORY_CFG_FLASH_C_E_P_R_CVSU_M \
                                0x00000FFF  // Compaction verify setup time in 
                                            // cycles. 

#define FACTORY_CFG_FLASH_C_E_P_R_CVSU_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_FLASH_P_R_PV register.
//
//*****************************************************************************
#define FACTORY_CFG_FLASH_P_R_PV_PH_M \
                                0xFF000000  // Program hold time in 
                                            // half-microseconds after SAFELV 
                                            // goes low. Value will be 
                                            // converted to number of FCLK 
                                            // cycles by the flash device 
                                            // driver and the converted value 
                                            // is written to the PGM_OH field 
                                            // bits[15:8] of the FSM_P_OH 
                                            // register in the flash module 
                                            // when an erase/program operation 
                                            // is initiated. [PROD: DP] 

#define FACTORY_CFG_FLASH_P_R_PV_PH_S 24
#define FACTORY_CFG_FLASH_P_R_PV_RH_M \
                                0x00FF0000  // Read hold/mode transition time 
                                            // in cycles. Value will be written 
                                            // to the RD_H field bits[7:0] of 
                                            // the FSM_RD_H register in the 
                                            // flash module by the flash device 
                                            // driver when an erase/program 
                                            // operation is initiated. [PROD: 
                                            // DP] 

#define FACTORY_CFG_FLASH_P_R_PV_RH_S 16
#define FACTORY_CFG_FLASH_P_R_PV_PVH_M \
                                0x0000FF00  // Program verify hold time in 
                                            // half-microseconds after SAFELV 
                                            // goes low. Value will be 
                                            // converted to number of FCLK 
                                            // cycles by the flash device 
                                            // driver and the converted value 
                                            // is written to the PGM_VH field 
                                            // bits[15:0] of the FSM_PE_VH 
                                            // register in the flash module 
                                            // when an erase/program operation 
                                            // is initiated. [PROD: DP] 

#define FACTORY_CFG_FLASH_P_R_PV_PVH_S 8
#define FACTORY_CFG_FLASH_P_R_PV_PVH2_M \
                                0x000000FF  // Program verify row switch time 
                                            // in half-microseconds. 

