ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/components/driverlib/inc/pg1/hw_factory_cfg.h
#define FACTORY_CFG_FLASH_P_R_PV_PVH2_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_FLASH_EH_SEQ register.
//
//*****************************************************************************
#define FACTORY_CFG_FLASH_EH_SEQ_EH_M \
                                0xFF000000  // Erase hold time in 
                                            // half-microseconds after SAFELV 
                                            // goes low. Value will be 
                                            // converted to number of FCLK 
                                            // cycles by the flash device 
                                            // driver and the converted value 
                                            // is written to the ERA_OH field 
                                            // bits[15:0] of the FSM_ERA_OH 
                                            // register in the flash module 
                                            // when an erase/program operation 
                                            // is initiated. [PROD: DP] 

#define FACTORY_CFG_FLASH_EH_SEQ_EH_S 24
#define FACTORY_CFG_FLASH_EH_SEQ_SEQ_M \
                                0x00FF0000  // Pump sequence control. 

#define FACTORY_CFG_FLASH_EH_SEQ_SEQ_S 16
#define FACTORY_CFG_FLASH_EH_SEQ_VSTAT_M \
                                0x0000F000  // Max number of HCLK cycles 
                                            // allowed for pump brown-out. 
                                            // Value will be written to the 
                                            // VSTAT_CNT field bits[15:12] of 
                                            // the FSM_VSTAT register in the 
                                            // flash module by the flash device 
                                            // driver when an erase/program 
                                            // operation is initiated.. [PROD: 
                                            // DP] 

#define FACTORY_CFG_FLASH_EH_SEQ_VSTAT_S 12
#define FACTORY_CFG_FLASH_EH_SEQ_SM_FREQUENCY_M \
                                0x00000FFF  // Max FCLK frequency allowed for 
                                            // program, erase, and verify 
                                            // reads. 

#define FACTORY_CFG_FLASH_EH_SEQ_SM_FREQUENCY_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_FLASH_VHV_E register.
//
//*****************************************************************************
#define FACTORY_CFG_FLASH_VHV_E_VHV_E_START_M \
                                0xFFFF0000  // Starting VHV-Erase CT for 
                                            // stairstep erase. Value will be 
                                            // written to the BEG_EC_LEVEL 
                                            // field bits[19:16] of the 
                                            // FSM_PRG_PUL register in the 
                                            // flash module by the flash device 
                                            // driver when an erase/program 
                                            // operation is initiated. [PROD: 
                                            // DP] 

#define FACTORY_CFG_FLASH_VHV_E_VHV_E_START_S 16
#define FACTORY_CFG_FLASH_VHV_E_VHV_E_STEP_HIGHT_M \
                                0x0000FFFF  // Number of VHV CTs to step after 
                                            // each erase pulse (up to the 
                                            // max). The actual FMC register 
                                            // value should be one less than 
                                            // this since the FMC starts 
                                            // counting from zero. Value will 
                                            // be written to the EC_STEP_HIGHT 
                                            // field bits[3:0] of the 
                                            // FSM_EC_STEP_HIGHT register in 
                                            // the flash module by the flash 
                                            // device driver when an 
                                            // erase/program operation is 
                                            // initiated. [PROD: DP] 

#define FACTORY_CFG_FLASH_VHV_E_VHV_E_STEP_HIGHT_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_FLASH_PP register.
//
//*****************************************************************************
#define FACTORY_CFG_FLASH_PP_PUMP_SU_M \
                                0xFF000000  // Pump read->non-read mode 
                                            // transition time in 
                                            // half-microseconds (mainly for 
                                            // FPES). 

#define FACTORY_CFG_FLASH_PP_PUMP_SU_S 24
#define FACTORY_CFG_FLASH_PP_MAX_PP_M \
                                0x0000FFFF  // Max program pulse limit per 
                                            // program operation. Value will be 
                                            // written to the MAX_PRG_PUL field 
                                            // bits[11:0] of the FSM_PRG_PUL 
                                            // register in the flash module by 
                                            // the flash device driver when an 
                                            // erase/program operation is 
                                            // initiated. [PROD: DP] 

#define FACTORY_CFG_FLASH_PP_MAX_PP_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_FLASH_PROG_EP register.
//
//*****************************************************************************
#define FACTORY_CFG_FLASH_PROG_EP_MAX_EP_M \
                                0xFFFF0000  // Max erase pulse limit per erase 
                                            // operation. Value will be written 
                                            // to the MAX_ERA_PUL field 
                                            // bits[11:0] of the FSM_ERA_PUL 
                                            // register in the flash module by 
                                            // the flash device driver when an 
                                            // erase/program operation is 
                                            // initiated. [PROD: DP] 

#define FACTORY_CFG_FLASH_PROG_EP_MAX_EP_S 16
#define FACTORY_CFG_FLASH_PROG_EP_PROGRAM_PW_M \
                                0x0000FFFF  // Program pulse width in 
                                            // half-microseconds. Value will be 
                                            // converted to number of FCLK 
                                            // cycles by the flash device 
                                            // driver and the converted value 
                                            // is written to the PROG_PUL_WIDTH 
                                            // field bits[15:0] of the 
                                            // FSM_PRG_PW register in the flash 
                                            // module when a erase/program 
                                            // operation is initiated. [PROD: 
                                            // DP] 

