ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/components/driverlib/inc/pg1/hw_factory_cfg.h
#define FACTORY_CFG_FLASH_PROG_EP_PROGRAM_PW_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_FLASH_ERA_PW register.
//
//*****************************************************************************
#define FACTORY_CFG_FLASH_ERA_PW_ERASE_PW_M \
                                0xFFFFFFFF  // Erase pulse width in 
                                            // half-microseconds. Value will be 
                                            // converted to number of FCLK 
                                            // cycles by the flash device 
                                            // driver and the converted value 
                                            // is written to the FSM_ERA_PW 
                                            // field bits[31:0] of the 
                                            // FSM_ERA_PW register in the flash 
                                            // module when a erase/program 
                                            // operation is initiated. [PROD: 
                                            // DP] 

#define FACTORY_CFG_FLASH_ERA_PW_ERASE_PW_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_FLASH_VHV register.
//
//*****************************************************************************
#define FACTORY_CFG_FLASH_VHV_VHV_P_M \
                                0xFFFF0000  // VHV-Program CT. Value will be 
                                            // written to the bits[23:16] of 
                                            // the FVHVCT2 register in the 
                                            // flash module by the flash device 
                                            // driver when an erase/program 
                                            // operation is initiated. 
                                            // Bits[23:16] in this register 
                                            // covers both the TRIM13_P and 
                                            // VHVCT_P bit fields. [PROD: DP] 

#define FACTORY_CFG_FLASH_VHV_VHV_P_S 16
#define FACTORY_CFG_FLASH_VHV_VHV_E_M \
                                0x0000FFFF  // Max VHV-Erase CT for stairstep 
                                            // erase. This is also the voltage 
                                            // used in parametric tests. Value 
                                            // will be written to the 
                                            // bits[23:16] of the FVHVCT1 
                                            // register in the flash module by 
                                            // the flash device driver when an 
                                            // erase/program operation is 
                                            // initiated. Bits[23:16] of this 
                                            // register covers both the 
                                            // TRIM13_E and VHVCT_E bit fields. 
                                            // [PROD: DP] 

#define FACTORY_CFG_FLASH_VHV_VHV_E_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_FLASH_VHV_PV register.
//
//*****************************************************************************
#define FACTORY_CFG_FLASH_VHV_PV_VHV_PV_M \
                                0xFFFF0000  // VHV-Program Verify CT. Value 
                                            // will be written to bits[7:0] of 
                                            // the FVHVCT1 register in the 
                                            // flash module by the flash device 
                                            // driver when an erase/program 
                                            // operation is initiated. [PROD: 
                                            // DP] 

#define FACTORY_CFG_FLASH_VHV_PV_VHV_PV_S 16
#define FACTORY_CFG_FLASH_VHV_PV_VCG2P5_M \
                                0x0000FF00  // Control gate voltage during 
                                            // read, read margin, and erase 
                                            // verify. Value will be written to 
                                            // the VCG2P5CT field bits[12:8] of 
                                            // the FVNCT register in the flash 
                                            // module by the flash device 
                                            // driver when an erase/program 
                                            // operation is initiated. [PROD: 
                                            // DP] 

#define FACTORY_CFG_FLASH_VHV_PV_VCG2P5_S 8
#define FACTORY_CFG_FLASH_VHV_PV_VINH_M \
                                0x000000FF  // Inhibit voltage applied to 
                                            // unselected columns during 
                                            // programming. 

#define FACTORY_CFG_FLASH_VHV_PV_VINH_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_FLASH_V register.
//
//*****************************************************************************
#define FACTORY_CFG_FLASH_V_VSL_P_M \
                                0xFF000000  // Sourceline voltage applied to 
                                            // the selected block during 
                                            // programming. Value will be 
                                            // written to the VSL_P field 
                                            // bits[15:12] of the FVSLP 
                                            // register in the flash module by 
                                            // the flash device driver when an 
                                            // erase/program operation is 
                                            // initiated. [PROD: DP] 

#define FACTORY_CFG_FLASH_V_VSL_P_S 24
#define FACTORY_CFG_FLASH_V_VWL_P_M \
                                0x00FF0000  // Wordline voltage applied to the 
                                            // selected half-row during 
                                            // programming. Value will be 
                                            // written to the VWLCT_P field 
                                            // bits[4:0] of the FVWLCT register 
                                            // in the flash module by the flash 
                                            // device driver when an 
                                            // erase/program operation is 
                                            // initiated. [PROD: DP] 

