ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/components/driverlib/inc/pg1/hw_factory_cfg.h
#define FACTORY_CFG_FLASH_V_VWL_P_S 16
#define FACTORY_CFG_FLASH_V_V_READ_M \
                                0x0000FF00  // Wordline voltage applied to the 
                                            // selected block during reads and 
                                            // verifies. Value will be written 
                                            // to the VREADCT field bits[3:0] 
                                            // of the FVREADCT register in the 
                                            // flash module by the flash device 
                                            // driver when an erase/program 
                                            // operation is initiated. [PROD: 
                                            // DP] 

#define FACTORY_CFG_FLASH_V_V_READ_S 8
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_USER_ID register.
//
//*****************************************************************************
#define FACTORY_CFG_USER_ID_PG_REV_M \
                                0xF0000000  // PG revision number: This value 
                                            // will be written to the AON_WUC 
                                            // JTAGUSERCODE[31:28] register by 
                                            // boot FW while in safezone. 
                                            // [PROD: DF] 

#define FACTORY_CFG_USER_ID_PG_REV_S 28
#define FACTORY_CFG_USER_ID_VER_M \
                                0x0C000000  // Version number. This value will 
                                            // be written to the AON_WUC 
                                            // JTAGUSERCODE[27:26] register by 
                                            // boot FW while in safezone. 
                                            // [PROD: DF] 

#define FACTORY_CFG_USER_ID_VER_S 26
#define FACTORY_CFG_USER_ID_SEQUENCE_M \
                                0x00780000  // Sequence. This value will be 
                                            // written to the AON_WUC 
                                            // JTAGUSERCODE[22:19] register by 
                                            // boot FW while in safezone. 
                                            // [PROD: DF] 

#define FACTORY_CFG_USER_ID_SEQUENCE_S 19
#define FACTORY_CFG_USER_ID_PKG_M \
                                0x00070000  // Package type. This value will 
                                            // be written to the AON_WUC 
                                            // JTAGUSERCODE[18:16] register by 
                                            // boot FW while in safezone. 
                                            // [PROD: DF] 

#define FACTORY_CFG_USER_ID_PKG_S 16
#define FACTORY_CFG_USER_ID_PROTOCOL_M \
                                0x0000F000  // Protocols supported. This value 
                                            // will be written to the AON_WUC 
                                            // JTAGUSERCODE[15:12] register by 
                                            // boot FW while in safezone. 
                                            // [PROD: DF] 

#define FACTORY_CFG_USER_ID_PROTOCOL_S 12
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_FLASH_OTP_DATA1 register.
//
//*****************************************************************************
#define FACTORY_CFG_FLASH_OTP_DATA1_SAMPLE_PERIODE_M \
                                0xFFFFFF00  // Value will be written to the 
                                            // SAMPLE_PERIODE field bits[23:0] 
                                            // of the SAMPLE_PERIODE register 
                                            // in the flash module by boot FW 
                                            // while in safezone. [PROD: DP] 

#define FACTORY_CFG_FLASH_OTP_DATA1_SAMPLE_PERIODE_S 8
#define FACTORY_CFG_FLASH_OTP_DATA1_WAITSTATES_M \
                                0x000000FF  // Value will be written to the 
                                            // WAITSTATES field bits[7:0] of 
                                            // the WAITSTATES register in the 
                                            // flash module by boot FW while in 
                                            // safezone. In addition this value 
                                            // decremented by 1 will be written 
                                            // to the RWAIT bit field 
                                            // bits[11:8] in the FRDCNTL 
                                            // register if the value is less 
                                            // than the value of the 
                                            // WAIT_SYSCODE field. [PROD: DP] 

#define FACTORY_CFG_FLASH_OTP_DATA1_WAITSTATES_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_FLASH_OTP_DATA2 register.
//
//*****************************************************************************
#define FACTORY_CFG_FLASH_OTP_DATA2_PRE_SAMPLE_M \
                                0xFF000000  // Value will be written to the 
                                            // PRE_SAMPLE field bits[7:0] of 
                                            // the PRE_SAMPLE register in the 
                                            // flash module by boot FW while in 
                                            // safezone. [PROD: DP] 

#define FACTORY_CFG_FLASH_OTP_DATA2_PRE_SAMPLE_S 24
#define FACTORY_CFG_FLASH_OTP_DATA2_SAMHOLD_SA_M \
                                0x00FF0000  // Value will be written to the 
                                            // SAMHOLD_SA field bits[7:0] of 
                                            // the SAMHOLD_SA register in the 
                                            // flash module by boot FW while in 
                                            // safezone. [PROD: DP] 

#define FACTORY_CFG_FLASH_OTP_DATA2_SAMHOLD_SA_S 16
#define FACTORY_CFG_FLASH_OTP_DATA2_SAMHOLD_SU_M \
                                0x0000FF00  // Value will be written to the 
                                            // SAMHOLD_SU field bits[7:0] of 
                                            // the SAMHOLD_SU register in the 
                                            // flash module by boot FW while in 
                                            // safezone. [PROD: DP] 

