ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/components/driverlib/inc/pg1/hw_factory_cfg.h
#define FACTORY_CFG_FLASH_OTP_DATA2_SAMHOLD_SU_S 8
#define FACTORY_CFG_FLASH_OTP_DATA2_VIN_BY_PASS \
                                0x00000010  // Value will be written to the 
                                            // VIN_BY_PASS field bits[8] of the 
                                            // FSEQPMP register in the flash 
                                            // module by boot FW while in 
                                            // safezone. [PROD: DP] 

#define FACTORY_CFG_FLASH_OTP_DATA2_VIN_BY_PASS_M \
                                0x00000010
#define FACTORY_CFG_FLASH_OTP_DATA2_VIN_BY_PASS_S 4
#define FACTORY_CFG_FLASH_OTP_DATA2_ENABLE_SWINTF \
                                0x00000008  // Value will be written to the 
                                            // ENABLE_SWINTF field bits[3] of 
                                            // the CONFIG register in the flash 
                                            // module by boot FW while in 
                                            // safezone. [PROD: DP] 

#define FACTORY_CFG_FLASH_OTP_DATA2_ENABLE_SWINTF_M \
                                0x00000008
#define FACTORY_CFG_FLASH_OTP_DATA2_ENABLE_SWINTF_S 3
#define FACTORY_CFG_FLASH_OTP_DATA2_PROTECTCFG \
                                0x00000004  // Value will be written to the 
                                            // PROTECTCFG field bits[2] of the 
                                            // CONFIG register in the flash 
                                            // module by boot FW while in 
                                            // safezone. [PROD: DP] 

#define FACTORY_CFG_FLASH_OTP_DATA2_PROTECTCFG_M \
                                0x00000004
#define FACTORY_CFG_FLASH_OTP_DATA2_PROTECTCFG_S 2
#define FACTORY_CFG_FLASH_OTP_DATA2_DIS_STANDBY \
                                0x00000002  // Value will be written to the 
                                            // DIS_STANDBY field bits[1] of the 
                                            // CONFIG register in the flash 
                                            // module by boot FW while in 
                                            // safezone. [PROD: DP] 

#define FACTORY_CFG_FLASH_OTP_DATA2_DIS_STANDBY_M \
                                0x00000002
#define FACTORY_CFG_FLASH_OTP_DATA2_DIS_STANDBY_S 1
#define FACTORY_CFG_FLASH_OTP_DATA2_DIS_IDLE \
                                0x00000001  // Value will be written to the 
                                            // DIS_IDLE field bits[0] of the 
                                            // CONFIG register in the flash 
                                            // module by boot FW while in 
                                            // safezone. [PROD: DP] 

#define FACTORY_CFG_FLASH_OTP_DATA2_DIS_IDLE_M \
                                0x00000001
#define FACTORY_CFG_FLASH_OTP_DATA2_DIS_IDLE_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_FLASH_OTP_DATA3 register.
//
//*****************************************************************************
#define FACTORY_CFG_FLASH_OTP_DATA3_EC_STEP_SIZE_M \
                                0xFF800000  // Value will be written to the 
                                            // EC_STEP_SIZE field bits[24:16] 
                                            // of the FSM_STEP_SIZE register in 
                                            // the flash module by the flash 
                                            // device driver when a 
                                            // erase/program operation is 
                                            // initiated. [PROD: DP] 

#define FACTORY_CFG_FLASH_OTP_DATA3_EC_STEP_SIZE_S 23
#define FACTORY_CFG_FLASH_OTP_DATA3_DO_PRECOND \
                                0x00400000  // Value will be written to the 
                                            // DO_PRECOND field bit[23] of the 
                                            // FSM_ST_MACHINE register in the 
                                            // flash module by the flash device 
                                            // driver when a erase/program 
                                            // operation is initiated. Note 
                                            // that during a Total Erase 
                                            // operation the flash bank will 
                                            // always be erased with 
                                            // Precondition enabled independent 
                                            // of the value of this FCFG1 bit 
                                            // field. [PROD: DP] 

#define FACTORY_CFG_FLASH_OTP_DATA3_DO_PRECOND_M \
                                0x00400000
#define FACTORY_CFG_FLASH_OTP_DATA3_DO_PRECOND_S 22
#define FACTORY_CFG_FLASH_OTP_DATA3_MAX_EC_LEVEL_M \
                                0x003C0000  // Value will be written to the 
                                            // MAX_EC_LEVEL field bits[19:16] 
                                            // of the FSM_ERA_PUL register in 
                                            // the flash module by the flash 
                                            // device driver when a 
                                            // erase/program operation is 
                                            // initiated. [PROD: DP] 

#define FACTORY_CFG_FLASH_OTP_DATA3_MAX_EC_LEVEL_S 18
#define FACTORY_CFG_FLASH_OTP_DATA3_TRIM_1P7_M \
                                0x00030000  // Value will be written to the 
                                            // TRIM_1P7 field bits[21:20] of 
                                            // the FSEQCMP register in the 
                                            // flash module by the flash device 
                                            // driver when a erase/program 
                                            // operation is initiated. [PROD: 
                                            // DP] 

#define FACTORY_CFG_FLASH_OTP_DATA3_TRIM_1P7_S 16
#define FACTORY_CFG_FLASH_OTP_DATA3_FLASH_SIZE_M \
                                0x0000FF00  // This value will be written to 
                                            // the SECTORS field bits[7:0] of 
                                            // the FLASH_O_FLASH_SIZE register 
                                            // in the flash module by the boot 
                                            // FW while in safe zone. This 
                                            // register will be write protected 
                                            // by the boot FW by setting the 
                                            // CONFIG-bit in the 
                                            // FLASH_O_CONFIG-register. [PROD: 
                                            // DF] 

#define FACTORY_CFG_FLASH_OTP_DATA3_FLASH_SIZE_S 8
#define FACTORY_CFG_FLASH_OTP_DATA3_WAIT_SYSCODE_M \
                                0x000000FF  // Value will be written to the 
                                            // WAIT_SYSCODE field bits[7:0] of 
                                            // the WAITSYSCODE register in the 
                                            // flash module by boot FW code 
                                            // while in safezone. In addition 
                                            // this value decremented by 1 will 
                                            // be written to the RWAIT bit 
                                            // field bits[11:8] in the FRDCNTL 
                                            // register if the value is less 
                                            // than the value of the WAITSTATES 
                                            // field. [PROD: DP] 

#define FACTORY_CFG_FLASH_OTP_DATA3_WAIT_SYSCODE_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_MAC_BLE_0 register.
//
//*****************************************************************************
#define FACTORY_CFG_MAC_BLE_0_ADDR_0_31_M \
                                0xFFFFFFFF  // The first 32-bits of the 64-bit 
                                            // MAC BLE address [PROD: DF] 

