ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/components/driverlib/inc/pg1/hw_factory_cfg.h
#define FACTORY_CFG_MAC_BLE_0_ADDR_0_31_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_MAC_BLE_1 register.
//
//*****************************************************************************
#define FACTORY_CFG_MAC_BLE_1_ADDR_32_63_M \
                                0xFFFFFFFF  // The last 32-bits of the 64-bit 
                                            // MAC BLE address [PROD: DF] 

#define FACTORY_CFG_MAC_BLE_1_ADDR_32_63_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_MAC_15_4_0 register.
//
//*****************************************************************************
#define FACTORY_CFG_MAC_15_4_0_ADDR_0_31_M \
                                0xFFFFFFFF  // The first 32-bits of the 64-bit 
                                            // MAC 15.4 address [PROD: DF] 

#define FACTORY_CFG_MAC_15_4_0_ADDR_0_31_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_MAC_15_4_1 register.
//
//*****************************************************************************
#define FACTORY_CFG_MAC_15_4_1_ADDR_32_63_M \
                                0xFFFFFFFF  // The last 32-bits of the 64-bit 
                                            // MAC 15.4 address [PROD: DF] 

#define FACTORY_CFG_MAC_15_4_1_ADDR_32_63_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_ICEPICK_DEVICE_ID register.
//
//*****************************************************************************
#define FACTORY_CFG_ICEPICK_DEVICE_ID_DEVICE_ID_M \
                                0xFFFFFFFF  // This field shall holde a value 
                                            // that equals the value of the 
                                            // IcePick DEVICE_ID register. 
                                            // [PROD: X] 

#define FACTORY_CFG_ICEPICK_DEVICE_ID_DEVICE_ID_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_FCFG1_REVISION register.
//
//*****************************************************************************
#define FACTORY_CFG_FCFG1_REVISION_REV_M \
                                0xFFFFFFFF  // The revision number of the 
                                            // FCFG1 layout. This value will be 
                                            // read by application SW in order 
                                            // to determine which FCFG1 
                                            // parameters that have valid 
                                            // values. This revision number 
                                            // must be incremented by 1 before 
                                            // any devices are to be produced 
                                            // if the FCFG1 layout has changed 
                                            // since the previous production of 
                                            // devices. [PROD: X] 

#define FACTORY_CFG_FCFG1_REVISION_REV_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_MISC_OTP_DATA register.
//
//*****************************************************************************
#define FACTORY_CFG_MISC_OTP_DATA_TEST_PROGRAM_REV_M \
                                0x000000FF  // The revision of the test 
                                            // program used in the production 
                                            // process when FCFG1 was 
                                            // programmed. [PROD: X] 

#define FACTORY_CFG_MISC_OTP_DATA_TEST_PROGRAM_REV_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_CONFIG_IF_ADC register.
//
//*****************************************************************************
#define FACTORY_CFG_CONFIG_IF_ADC_FF2ADJ_M \
                                0xF0000000  // Trim value for the FF2ADJ bit 
                                            // field in the IFADC13 register in 
                                            // ADI_0_RF [PROD: X] 

#define FACTORY_CFG_CONFIG_IF_ADC_FF2ADJ_S 28
#define FACTORY_CFG_CONFIG_IF_ADC_FF3ADJ_M \
                                0x0F000000  // Trim value for the FF3ADJ bit 
                                            // field in the IFADC13 register in 
                                            // ADI_0_RF [PROD: X] 

#define FACTORY_CFG_CONFIG_IF_ADC_FF3ADJ_S 24
#define FACTORY_CFG_CONFIG_IF_ADC_INT3ADJ_M \
                                0x00F00000  // Trim value for the INT3ADJ bit 
                                            // field in the IFADC12 register in 
                                            // ADI_0_RF [PROD: X] 

#define FACTORY_CFG_CONFIG_IF_ADC_INT3ADJ_S 20
#define FACTORY_CFG_CONFIG_IF_ADC_FF1ADJ_M \
                                0x000F0000  // Trim value for the FF1ADJ bit 
                                            // field in the IFADC12 register in 
                                            // ADI_0_RF [PROD: X] 

#define FACTORY_CFG_CONFIG_IF_ADC_FF1ADJ_S 16
#define FACTORY_CFG_CONFIG_IF_ADC_AAFCAP_M \
                                0x0000C000  // Trim value for the AAFCAP bit 
                                            // field in the IFADC11 register in 
                                            // ADI_0_RF [PROD: X] 

