ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/components/driverlib/inc/pg1/hw_factory_cfg.h
#define FACTORY_CFG_CONFIG_IF_ADC_AAFCAP_S 14
#define FACTORY_CFG_CONFIG_IF_ADC_INT2ADJ_M \
                                0x00003C00  // Trim value for the INT2ADJ bit 
                                            // field in the IFADC11 register in 
                                            // ADI_0_RF [PROD: X] 

#define FACTORY_CFG_CONFIG_IF_ADC_INT2ADJ_S 10
#define FACTORY_CFG_CONFIG_IF_ADC_RESISTOR_TREE_TRIM_M \
                                0x000003E0  // Trim value for the 
                                            // RESISTOR_TREE_TRIM bit field in 
                                            // the IFDLDO2 register in ADI_0_RF 
                                            // [PROD: X] 

#define FACTORY_CFG_CONFIG_IF_ADC_RESISTOR_TREE_TRIM_S 5
#define FACTORY_CFG_CONFIG_IF_ADC_FEEDBACK_TREE_TRIM_M \
                                0x0000001F  // Trim value for the 
                                            // FEEDBACK_TREE_TRIM bit field in 
                                            // the IFALDO2 register in ADI_0_RF 
                                            // [PROD: X] 

#define FACTORY_CFG_CONFIG_IF_ADC_FEEDBACK_TREE_TRIM_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_CONFIG_OSC_TOP register.
//
//*****************************************************************************
#define FACTORY_CFG_CONFIG_OSC_TOP_XOSC_HF_ROW_Q12_M \
                                0x3C000000  // Trim value for the 
                                            // XOSC_HF_ROW_Q12 bit field in the 
                                            // ANABYPASS_VALUE1 register in 
                                            // OSC_DIG [PROD: X] 

#define FACTORY_CFG_CONFIG_OSC_TOP_XOSC_HF_ROW_Q12_S 26
#define FACTORY_CFG_CONFIG_OSC_TOP_XOSC_HF_COLUMN_Q12_M \
                                0x03FFFC00  // Trim value for the 
                                            // XOSC_HF_COLUMN_Q12 bit field in 
                                            // the ANABYPASS_VALUE1 register in 
                                            // OSC_DIG [PROD: X] 

#define FACTORY_CFG_CONFIG_OSC_TOP_XOSC_HF_COLUMN_Q12_S 10
#define FACTORY_CFG_CONFIG_OSC_TOP_RCOSCLF_CTUNE_TRIM_M \
                                0x000003FC  // Trim value for the 
                                            // RCOSCLF_CTUNE_TRIM bit field in 
                                            // the XOSCLF_RCOSCLF_CTRL register 
                                            // in OSC_DIG [PROD: X] 

#define FACTORY_CFG_CONFIG_OSC_TOP_RCOSCLF_CTUNE_TRIM_S 2
#define FACTORY_CFG_CONFIG_OSC_TOP_RCOSCLF_RTUNE_TRIM_M \
                                0x00000003  // Trim value for the 
                                            // RCOSCLF_RTUNE_TRIM bit field in 
                                            // the XOSCLF_RCOSCLF_CTRL register 
                                            // in OSC_DIG [PROD: X] 

#define FACTORY_CFG_CONFIG_OSC_TOP_RCOSCLF_RTUNE_TRIM_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_CONFIG_RF_FRONTEND register.
//
//*****************************************************************************
#define FACTORY_CFG_CONFIG_RF_FRONTEND_IFAMP_IB_M \
                                0xF0000000  // Trim value used for the 
                                            // IFAMP_IB bit field in the 
                                            // CTL_IFAMP3 register in ADI_0_RF 
                                            // [PROD: X] 

#define FACTORY_CFG_CONFIG_RF_FRONTEND_IFAMP_IB_S 28
#define FACTORY_CFG_CONFIG_RF_FRONTEND_LNA_IB_M \
                                0x0F000000  // Trim value used for the LNA_IB 
                                            // bit field in the CTL_LNA2 
                                            // register in ADI_0_RF [PROD: X] 

#define FACTORY_CFG_CONFIG_RF_FRONTEND_LNA_IB_S 24
#define FACTORY_CFG_CONFIG_RF_FRONTEND_IFAMP_TRIM_M \
                                0x00F80000  // Trim value used for the 
                                            // IFAMP_TRIM bit field in the 
                                            // CTL_IFAMP0 register in ADI_0_RF 
                                            // [PROD: X] 

#define FACTORY_CFG_CONFIG_RF_FRONTEND_IFAMP_TRIM_S 19
#define FACTORY_CFG_CONFIG_RF_FRONTEND_CTL_PA0_TRIM_M \
                                0x00078000  // Trim value used for the TRIM 
                                            // bit field in the CTL_PA0 
                                            // register in ADI_0_RF [PROD: X] 

#define FACTORY_CFG_CONFIG_RF_FRONTEND_CTL_PA0_TRIM_S 15
#define FACTORY_CFG_CONFIG_RF_FRONTEND_CTL_PA1_GC_M \
                                0x00006000  // Trim value used for the GC bit 
                                            // field in the CTL_PA1 register in 
                                            // ADI_0_RF [PROD: X] 

#define FACTORY_CFG_CONFIG_RF_FRONTEND_CTL_PA1_GC_S 13
#define FACTORY_CFG_CONFIG_RF_FRONTEND_CTL_PA1_IB_M \
                                0x00001F80  // Trim value used for the IB bit 
                                            // field in the CTL_PA1 register in 
                                            // ADI_0_RF [PROD: X] 

#define FACTORY_CFG_CONFIG_RF_FRONTEND_CTL_PA1_IB_S 7
#define FACTORY_CFG_CONFIG_RF_FRONTEND_RFLDO_RESISTOR_TRIM_M \
                                0x0000007F  // Trim value for the 
                                            // RFLDO_RESISTOR_TRIM bit field in 
                                            // the RF_LDO_2 register in 
                                            // ADI_0_RF [PROD: X] 

#define FACTORY_CFG_CONFIG_RF_FRONTEND_RFLDO_RESISTOR_TRIM_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_CONFIG_SYNTH register.
//
//*****************************************************************************
#define FACTORY_CFG_CONFIG_SYNTH_LDOVCO_RESISTOR_TRIM_M \
                                0x00000FC0  // Trim value ised for the 
                                            // LDOVCO_RESISTOR_TRIM bit field 
                                            // in theCTL_LDOVCO_2 register in 
                                            // ADI_1_SYNTH [PROD: X] 

#define FACTORY_CFG_CONFIG_SYNTH_LDOVCO_RESISTOR_TRIM_S 6
#define FACTORY_CFG_CONFIG_SYNTH_SLDO_RESISTOR_TRIM_M \
                                0x0000003F  // Trim value ised for the 
                                            // SLDO_RESISTOR_TRIM bit field in 
                                            // the SLDO_2 register in 
                                            // ADI_1_SYNTH [PROD: X] 

#define FACTORY_CFG_CONFIG_SYNTH_SLDO_RESISTOR_TRIM_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_SOC_ADC_ABS_GAIN register.
//
//*****************************************************************************
#define FACTORY_CFG_SOC_ADC_ABS_GAIN_SOC_ADC_ABS_GAIN_TEMP2_M \
                                0xFFFF0000  // SOC_ADC gain in absolute 
                                            // reference mode at temperature 2 
                                            // (85C?). Calculated in production 
                                            // test. [PROD: X] 

