ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/components/driverlib/inc/pg1/hw_factory_cfg.h
#define FACTORY_CFG_SOC_ADC_ABS_GAIN_SOC_ADC_ABS_GAIN_TEMP2_S 16
#define FACTORY_CFG_SOC_ADC_ABS_GAIN_SOC_ADC_ABS_GAIN_TEMP1_M \
                                0x0000FFFF  // SOC_ADC gain in absolute 
                                            // reference mode at temperature 1 
                                            // (25C?). Calculated in production 
                                            // test.. [PROD: X] 

#define FACTORY_CFG_SOC_ADC_ABS_GAIN_SOC_ADC_ABS_GAIN_TEMP1_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_SOC_ADC_REL_GAIN register.
//
//*****************************************************************************
#define FACTORY_CFG_SOC_ADC_REL_GAIN_SOC_ADC_REL_GAIN_TEMP2_M \
                                0xFFFF0000  // SOC_ADC gain in relative 
                                            // reference mode at temperature 2 
                                            // (85C?). Calculated in production 
                                            // test.. [PROD: X] 

#define FACTORY_CFG_SOC_ADC_REL_GAIN_SOC_ADC_REL_GAIN_TEMP2_S 16
#define FACTORY_CFG_SOC_ADC_REL_GAIN_SOC_ADC_REL_GAIN_TEMP1_M \
                                0x0000FFFF  // SOC_ADC gain in relative 
                                            // reference mode at temperature 1 
                                            // (25C?). Calculated in production 
                                            // test.. [PROD: X] 

#define FACTORY_CFG_SOC_ADC_REL_GAIN_SOC_ADC_REL_GAIN_TEMP1_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_SOC_ADC_EXT_GAIN register.
//
//*****************************************************************************
#define FACTORY_CFG_SOC_ADC_EXT_GAIN_SOC_ADC_EXT_GAIN_TEMP2_M \
                                0xFFFF0000  // SOC_ADC gain in external 
                                            // reference mode at temperature 2 
                                            // (85C?). Calculated in production 
                                            // test.. [PROD: X] 

#define FACTORY_CFG_SOC_ADC_EXT_GAIN_SOC_ADC_EXT_GAIN_TEMP2_S 16
#define FACTORY_CFG_SOC_ADC_EXT_GAIN_SOC_ADC_EXT_GAIN_TEMP1_M \
                                0x0000FFFF  // SOC_ADC gain in external 
                                            // reference mode at temperature 1 
                                            // (25C?). Calculated in production 
                                            // test.. [PROD: X] 

#define FACTORY_CFG_SOC_ADC_EXT_GAIN_SOC_ADC_EXT_GAIN_TEMP1_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_SOC_ADC_OFFSET_INT register.
//
//*****************************************************************************
#define FACTORY_CFG_SOC_ADC_OFFSET_INT_SOC_ADC_REL_OFFSET_TEMP2_M \
                                0xFF000000  // SOC_ADC offset in relative 
                                            // reference mode at temperature 2 
                                            // (85C?). Signed 8-bit number. 
                                            // Calculated in production test.. 
                                            // [PROD: X] 

#define FACTORY_CFG_SOC_ADC_OFFSET_INT_SOC_ADC_REL_OFFSET_TEMP2_S 24
#define FACTORY_CFG_SOC_ADC_OFFSET_INT_SOC_ADC_REL_OFFSET_TEMP1_M \
                                0x00FF0000  // SOC_ADC offset in relative 
                                            // reference mode at temperature 1 
                                            // (25C?). Signed 8-bit number. 
                                            // Calculated in production test.. 
                                            // [PROD: X] 

#define FACTORY_CFG_SOC_ADC_OFFSET_INT_SOC_ADC_REL_OFFSET_TEMP1_S 16
#define FACTORY_CFG_SOC_ADC_OFFSET_INT_SOC_ADC_ABS_OFFSET_TEMP2_M \
                                0x0000FF00  // SOC_ADC offset in absolute 
                                            // reference mode at temperature 2 
                                            // (85C?). Signed 8-bit number. 
                                            // Calculated in production test.. 
                                            // [PROD: X] 

#define FACTORY_CFG_SOC_ADC_OFFSET_INT_SOC_ADC_ABS_OFFSET_TEMP2_S 8
#define FACTORY_CFG_SOC_ADC_OFFSET_INT_SOC_ADC_ABS_OFFSET_TEMP1_M \
                                0x000000FF  // SOC_ADC offset in absolute 
                                            // reference mode at temperature 1 
                                            // (25C?). Signed 8-bit number. 
                                            // Calculated in production test.. 
                                            // [PROD: X] 

#define FACTORY_CFG_SOC_ADC_OFFSET_INT_SOC_ADC_ABS_OFFSET_TEMP1_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_SOC_ADC_REF_TRIM_AND_OFFSET_EXT register.
//
//*****************************************************************************
#define FACTORY_CFG_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_SOC_ADC_EXT_OFFSET_TEMP2_M \
                                0xFF000000  // SOC_ADC offset in external 
                                            // reference mode at temperature 2 
                                            // (85C?). Signed 8-bit number. 
                                            // Calculated in production test.. 
                                            // [PROD: X] 

#define FACTORY_CFG_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_SOC_ADC_EXT_OFFSET_TEMP2_S 24
#define FACTORY_CFG_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_SOC_ADC_EXT_OFFSET_TEMP1_M \
                                0x00FF0000  // SOC_ADC offset in external 
                                            // reference mode at temperature 1 
                                            // (25C?). Signed 8-bit number. 
                                            // Calculated in production test.. 
                                            // [PROD: X] 

#define FACTORY_CFG_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_SOC_ADC_EXT_OFFSET_TEMP1_S 16
#define FACTORY_CFG_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_TEST_TEMP_INDEX2_M \
                                0x0000C000  // Index of TEST_TEMP1-4 that was 
                                            // used to when the _TEMP2 fields 
                                            // for SOC_ADC were written. [PROD: 
                                            // X] 

#define FACTORY_CFG_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_TEST_TEMP_INDEX2_S 14
#define FACTORY_CFG_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_SOC_ADC_REF_VOLTAGE_TRIM_TEMP2_M \
                                0x00003F00  // Value to write in 
                                            // ADI4_AUX.CTL2_3_ADC_REF[5:0] at 
                                            // temperature 2 (85C?). [PROD: X] 

#define FACTORY_CFG_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_SOC_ADC_REF_VOLTAGE_TRIM_TEMP2_S 8
#define FACTORY_CFG_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_TEST_TEMP_INDEX1_M \
                                0x000000C0  // Index of TEST_TEMP1-4 that was 
                                            // used to when the _TEMP1 fields 
                                            // for SOC_ADC were written. This 
                                            // should always be room temp. 
                                            // [PROD: X] 

#define FACTORY_CFG_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_TEST_TEMP_INDEX1_S 6
#define FACTORY_CFG_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_SOC_ADC_REF_VOLTAGE_TRIM_TEMP1_M \
                                0x0000003F  // Value to write in 
                                            // ADI4_AUX.CTL2_3_ADC_REF[5:0] at 
                                            // temperature 1 (25C?). [PROD: X] 

