ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/components/driverlib/inc/pg1/hw_factory_cfg.h
#define FACTORY_CFG_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_SOC_ADC_REF_VOLTAGE_TRIM_TEMP1_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_AMPCOMP_TH1 register.
//
//*****************************************************************************
#define FACTORY_CFG_AMPCOMP_TH1_HPMRAMP2_TH_M \
                                0xFC000000  // HPM Ramp2 amplitude threshhold. 
                                            // In HPM_RAMP2, if amp < 
                                            // HPMRAMP2_TH then move on. [PROD: 
                                            // X] 

#define FACTORY_CFG_AMPCOMP_TH1_HPMRAMP2_TH_S 26
#define FACTORY_CFG_AMPCOMP_TH1_HPMRAMP3_LTH_M \
                                0x00FC0000  // HPM Ramp3 low amplitude 
                                            // threshhold. In HPM_RAMP3, if amp 
                                            // > HPMRAMP3_LTH && amp < 
                                            // HPMRAMP3_HTH then move on 
                                            // HPM_UPDATE. [PROD: X] 

#define FACTORY_CFG_AMPCOMP_TH1_HPMRAMP3_LTH_S 18
#define FACTORY_CFG_AMPCOMP_TH1_HPMRAMP3_HTH_M \
                                0x0000FC00  // In HPM_RAMP3, if amp > 
                                            // HPMRAMP3_LTH && amp < 
                                            // HPMRAMP3_HTH then move on to 
                                            // HPM_UPDATE. [PROD: X] 

#define FACTORY_CFG_AMPCOMP_TH1_HPMRAMP3_HTH_S 10
#define FACTORY_CFG_AMPCOMP_TH1_IBIASCAP_LPTOHP_OL_CNT_M \
                                0x000003C0  // During XOSC mode transition, 
                                            // CAP trim and IBIAS trim should 
                                            // be modified by this amount. 
                                            // IBIAS and CAP trim open loop 
                                            // count. CAP_REM is remainder of 
                                            // the CAP that is left to reach 
                                            // the final cap value. [PROD: X] 

#define FACTORY_CFG_AMPCOMP_TH1_IBIASCAP_LPTOHP_OL_CNT_S 6
#define FACTORY_CFG_AMPCOMP_TH1_HPMRAMP1_TH_M \
                                0x0000003F  // During XOSC mode transition, 
                                            // CAP trim and IBIAS trim should 
                                            // be modified by this amount. 
                                            // IBIAS and CAP trim open loop 
                                            // count. CAP_REM is remainder of 
                                            // the CAP that is left to reach 
                                            // the final cap value. [PROD: X] 

#define FACTORY_CFG_AMPCOMP_TH1_HPMRAMP1_TH_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_AMPCOMP_TH2 register.
//
//*****************************************************************************
#define FACTORY_CFG_AMPCOMP_TH2_LPMUPDATE_LTH_M \
                                0xFC000000  // LPM Update low amplitude 
                                            // threshhold. if amp > 
                                            // LPMUPDATE_LTH && amp < 
                                            // LPMUPDATE_HTH then move on. 
                                            // [PROD: X] 

#define FACTORY_CFG_AMPCOMP_TH2_LPMUPDATE_LTH_S 26
#define FACTORY_CFG_AMPCOMP_TH2_LPMUPDATE_HTM_M \
                                0x00FC0000  // LPM Update high amplitude 
                                            // threshhold. if amp > 
                                            // LPMUPDATE_LTH && amp < 
                                            // LPMUPDATE_HTH then move on. 
                                            // [PROD: X] 

#define FACTORY_CFG_AMPCOMP_TH2_LPMUPDATE_HTM_S 18
#define FACTORY_CFG_AMPCOMP_TH2_ADC_COMP_AMPTH_LPM_M \
                                0x0000FC00  // When ADC is forced in 
                                            // comparator mode, this value is 
                                            // used as OPAMP's threshold during 
                                            // LPM_UPDATE mode. Actual 
                                            // amplitude is compared against 
                                            // this threshhold to generate 
                                            // 1-bit adc_threshholdmet 
                                            // indicator output. [PROD: X] 

#define FACTORY_CFG_AMPCOMP_TH2_ADC_COMP_AMPTH_LPM_S 10
#define FACTORY_CFG_AMPCOMP_TH2_ADC_COMP_AMPTH_HPM_M \
                                0x000000FC  // When ADC is forced in 
                                            // comparator mode, this value is 
                                            // used as OPAMP's threshold during 
                                            // HPM_UPDATE mode. Actual 
                                            // amplitude is compared against 
                                            // this threshhold to generate 
                                            // 1-bit adc_threshholdmet 
                                            // indicator output. [PROD: X] 

#define FACTORY_CFG_AMPCOMP_TH2_ADC_COMP_AMPTH_HPM_S 2
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_AMPCOMP_CTRL1 register.
//
//*****************************************************************************
#define FACTORY_CFG_AMPCOMP_CTRL1_IBIAS_OFFSET_M \
                                0x00F00000  // Offset values of XOSC IBIAS 
                                            // trim. IBIAS trim value would 
                                            // always be greater than or equal 
                                            // to this offset in both HPM and 
                                            // LPM. [PROD: X] 

#define FACTORY_CFG_AMPCOMP_CTRL1_IBIAS_OFFSET_S 20
#define FACTORY_CFG_AMPCOMP_CTRL1_IBIAS_INIT_M \
                                0x000F0000  // Initial value of XOSC IBIAS 
                                            // trim. During ramping up, IBIAS 
                                            // is set to IBIAS_OFFSET + 
                                            // IBIAS_INIT. [PROD: X] 

#define FACTORY_CFG_AMPCOMP_CTRL1_IBIAS_INIT_S 16
#define FACTORY_CFG_AMPCOMP_CTRL1_LPM_IBIAS_WAIT_CNT_FINAL_M \
                                0x0000FF00  // FSM waits for 
                                            // ddi_lpm_ibias_wait_cnt_final 
                                            // clock cycles in 
                                            // IDAC_DECREMENT_WITH_MEASURE 
                                            // states in order to compensate 
                                            // slow response of the xtal. 
                                            // 8-bits. [PROD: X] 

