ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/components/driverlib/inc/pg1/hw_factory_cfg.h
#define FACTORY_CFG_AMPCOMP_CTRL1_LPM_IBIAS_WAIT_CNT_FINAL_S 8
#define FACTORY_CFG_AMPCOMP_CTRL1_CAP_STEP_M \
                                0x000000F0  // Step size of XOSC CAP trim 
                                            // (both Q1 and Q2) during XOSC 
                                            // mode transition. Can vary from 6 
                                            // to 12. Other values are possible 
                                            // but not valid. [PROD: X] 

#define FACTORY_CFG_AMPCOMP_CTRL1_CAP_STEP_S 4
#define FACTORY_CFG_AMPCOMP_CTRL1_IBIASCAP_HPTOLP_OL_CNT_M \
                                0x0000000F  // During HPM to LPM transition, 
                                            // CAP trim and IBIAS trim should 
                                            // be modified by this amount. 
                                            // IBIAS and CAP trim open loop 
                                            // count. CAP_REM is remainder of 
                                            // the CAP that is left to reach 
                                            // the final cap value. Do not need 
                                            // to program this. CAP_TRIM = 
                                            // CAP_INIT - 
                                            // CAP_STEP*IBIASCAP_HPTOLP_OL_CNT 
                                            // - CAP_REM; IBIAS_TRIM = 
                                            // IBIAS_INIT - 
                                            // 1*IBIASCAP_HPTOLP_OL_CNT; Here, 
                                            // cap_init is decimal conversion 
                                            // of cap_init_col and 
                                            // cap_init_row. [PROD: X] 

#define FACTORY_CFG_AMPCOMP_CTRL1_IBIASCAP_HPTOLP_OL_CNT_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_ANABYPASS_VALUE2 register.
//
//*****************************************************************************
#define FACTORY_CFG_ANABYPASS_VALUE2_XOSC_HF_IBIASTHERM_M \
                                0x00003FFF  // Value of xosc_hf_ibiastherm 
                                            // when oscdig is bypassed. [PROD: 
                                            // X] 

#define FACTORY_CFG_ANABYPASS_VALUE2_XOSC_HF_IBIASTHERM_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_CONFIG_MISC_ADC register.
//
//*****************************************************************************
#define FACTORY_CFG_CONFIG_MISC_ADC_RSSI_OFFSET_M \
                                0x0001FE00  // Value for RSSI measured in 
                                            // production test [PROD: X] 

#define FACTORY_CFG_CONFIG_MISC_ADC_RSSI_OFFSET_S 9
#define FACTORY_CFG_CONFIG_MISC_ADC_QUANTCTLTHRES_M \
                                0x000001C0  // Trim value for the 
                                            // QUANTCTLTHRES bit field in the 
                                            // IFADC21 register in ADI_0_RF 
                                            // [PROD: X] 

#define FACTORY_CFG_CONFIG_MISC_ADC_QUANTCTLTHRES_S 6
#define FACTORY_CFG_CONFIG_MISC_ADC_DACTRIM_M \
                                0x0000003F  // Trim value for the DACTRIM bit 
                                            // field in the IFADC14 register in 
                                            // ADI_0_RF [PROD: X] 

#define FACTORY_CFG_CONFIG_MISC_ADC_DACTRIM_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_TEST_TEMPS register.
//
//*****************************************************************************
#define FACTORY_CFG_TEST_TEMPS_TEST_TEMP4_M \
                                0xFF000000  // Temperature for the 4. test 
                                            // insertion. Valid values -40C to 
                                            // 125C. 0xFF means not (yet) run. 
                                            // [PROD: X] 

#define FACTORY_CFG_TEST_TEMPS_TEST_TEMP4_S 24
#define FACTORY_CFG_TEST_TEMPS_TEST_TEMP3_M \
                                0x00FF0000  // Temperature for the 3. test 
                                            // insertion. Valid values -40C to 
                                            // 125C. 0xFF means not (yet) run. 
                                            // [PROD: X] 

#define FACTORY_CFG_TEST_TEMPS_TEST_TEMP3_S 16
#define FACTORY_CFG_TEST_TEMPS_TEST_TEMP2_M \
                                0x0000FF00  // Temperature for the 2. test 
                                            // insertion. Valid values -40C to 
                                            // 125C. 0xFF means not (yet) run. 
                                            // [PROD: X] 

#define FACTORY_CFG_TEST_TEMPS_TEST_TEMP2_S 8
#define FACTORY_CFG_TEST_TEMPS_TEST_TEMP1_M \
                                0x000000FF  // Temperature for the 1. test 
                                            // insertion. Valid values -40C to 
                                            // 125C. 0xFF means not (yet) run. 
                                            // [PROD: X] 

#define FACTORY_CFG_TEST_TEMPS_TEST_TEMP1_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_VOLT_TRIM register.
//
//*****************************************************************************
#define FACTORY_CFG_VOLT_TRIM_VDDR_TRIM_HH_M \
                                0x1F000000  // TBD: Trim value for 1.94V VDDR 
                                            // found in production test (for 
                                            // CC13xx high PA output power 
                                            // only). 

#define FACTORY_CFG_VOLT_TRIM_VDDR_TRIM_HH_S 24
#define FACTORY_CFG_VOLT_TRIM_VDDR_TRIM_H_M \
                                0x001F0000  // Trim value for 1.85V VDDR found 
                                            // in production test (for external 
                                            // VDDR load mode) 

