ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/components/driverlib/inc/pg1/hw_factory_cfg.h
#define FACTORY_CFG_VOLT_TRIM_VDDR_TRIM_H_S 16
#define FACTORY_CFG_VOLT_TRIM_VDDR_TRIM_SLEEP_H_M \
                                0x00001F00  // Trim value for 1.75V VDDR 
                                            // recharge target found in 
                                            // production test (for external 
                                            // VDDR load mode). 

#define FACTORY_CFG_VOLT_TRIM_VDDR_TRIM_SLEEP_H_S 8
#define FACTORY_CFG_VOLT_TRIM_TRIMBOD_H_M \
                                0x0000001F  // Trim value for 2.0V VDDS BOD 
                                            // target found in production test. 

#define FACTORY_CFG_VOLT_TRIM_TRIMBOD_H_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_OSC_CONF register.
//
//*****************************************************************************
#define FACTORY_CFG_OSC_CONF_XOSC_OPTION \
                                0x00040000  // 1 = XOSC_HF available (default) 
                                            // 0 = XOSC_HF unavailable (may not 
                                            // be bonded out) 

#define FACTORY_CFG_OSC_CONF_XOSC_OPTION_M \
                                0x00040000
#define FACTORY_CFG_OSC_CONF_XOSC_OPTION_S 18
#define FACTORY_CFG_OSC_CONF_BAW_OPTION \
                                0x00020000  // 1 = BAW unavailable (default) 0 
                                            // = BAW available 

#define FACTORY_CFG_OSC_CONF_BAW_OPTION_M \
                                0x00020000
#define FACTORY_CFG_OSC_CONF_BAW_OPTION_S 17
#define FACTORY_CFG_OSC_CONF_BAW_FREQ \
                                0x00010000  // 1 = 2520MHz (default) 0 = 
                                            // 840MHz 

#define FACTORY_CFG_OSC_CONF_BAW_FREQ_M \
                                0x00010000
#define FACTORY_CFG_OSC_CONF_BAW_FREQ_S 16
#define FACTORY_CFG_OSC_CONF_BAW_TRIM_M \
                                0x0000FFFF  // (TBD contents for now, trimmed 
                                            // in production test for BAW 
                                            // devices 

#define FACTORY_CFG_OSC_CONF_BAW_TRIM_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_FREQ_OFFSET register.
//
//*****************************************************************************
#define FACTORY_CFG_FREQ_OFFSET_BAW_COMP_P0_M \
                                0xFFFF0000  // Signed 16-bit value, 
                                            // representing the frequency 
                                            // offset at 27 degrees C. 

#define FACTORY_CFG_FREQ_OFFSET_BAW_COMP_P0_S 16
#define FACTORY_CFG_FREQ_OFFSET_BAW_COMP_P1_M \
                                0x0000FF00  // Signed 8-bit value, 
                                            // representing the first order 
                                            // frequency offset slope. 

#define FACTORY_CFG_FREQ_OFFSET_BAW_COMP_P1_S 8
#define FACTORY_CFG_FREQ_OFFSET_BAW_COMP_P2_M \
                                0x000000FF  // Signed 8-bit value, 
                                            // representing the second order 
                                            // frequency offset slope. The 
                                            // actual frequency of the clock 
                                            // would be defined as 48MHz∙(1+d), 
                                            // where d = P0∙2¯²² + 
                                            // P1∙(T-27)∙2¯²⁵ + 
                                            // P2∙(T-27)²∙2¯³¹. 

#define FACTORY_CFG_FREQ_OFFSET_BAW_COMP_P2_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// FACTORY_CFG_O_CAP_TRIM register.
//
//*****************************************************************************
#define FACTORY_CFG_CAP_TRIM_FLUX_CAP_0P28_TRIM_M \
                                0xFFFF0000  

#define FACTORY_CFG_CAP_TRIM_FLUX_CAP_0P28_TRIM_S 16
#define FACTORY_CFG_CAP_TRIM_FLUX_CAP_0P4_TRIM_M \
                                0x0000FFFF  

#define FACTORY_CFG_CAP_TRIM_FLUX_CAP_0P4_TRIM_S 0


#endif // __FACTORY_CFG_H__

